app/Controllers/Admin.php

SELECT *
FROM `kost`
---
    public function EditKosan($id_kosan)
    {
        $model = new ModelKost();

        // Lakukan join dengan model-model lainnya berdasarkan kolom yang sesuai
        $model->select('*');
        $model->join('kamar', 'kamar.id_kamar = kost.id_kamar');
        $model->join('kamar_mandi', 'kamar_mandi.id_kamar_mandi = kost.id_kamar_mandi');
        $model->join('peraturan', 'peraturan.id_peraturan = kost.id_peraturan');
        $model->join('fasilitas_umum', 'fasilitas_umum.id_fasum = kost.id_fasum');
        $model->join('fasilitas_parkir', 'fasilitas_parkir.id_fparkir = kost.id_fparkir');

        // Ambil data kosan berdasarkan $id_kosan
        $data['value'] = $model->find($id_kosan);

        // Jika Anda ingin mengambil data dari tabel terkait
        $data['kamar_data'] = $model->findAll();