app/Models/ModelKost.php

    public function SemuaData()
    {
        // Lakukan join dengan model-model lainnya berdasarkan kolom yang sesuai
        $builder = $this->db->table('kost');
        $builder->select('kost.*, kamar.*, kamar_mandi.*, peraturan.*, fasilitas_umum.*, fasilitas_parkir.*');
        $builder->join('kamar', 'kamar.id_kamar = kost.id_kamar');
        $builder->join('kamar_mandi', 'kamar_mandi.id_kamar_mandi = kost.id_kamar_mandi');
        $builder->join('peraturan', 'peraturan.id_peraturan = kost.id_peraturan');
        $builder->join('fasilitas_umum', 'fasilitas_umum.id_fasum = kost.id_fasum');
        $builder->join('fasilitas_parkir', 'fasilitas_parkir.id_fparkir = kost.id_fparkir');

        // Eksekusi query
        $query = $builder->get();
---
SELECT `kost`.*, `kamar`.*, `kamar_mandi`.*, `peraturan`.*, `fasilitas_umum`.*, `fasilitas_parkir`.*
FROM `kost`
JOIN `kamar` ON `kamar`.`id_kamar` = `kost`.`id_kamar`
JOIN `kamar_mandi` ON `kamar_mandi`.`id_kamar_mandi` = `kost`.`id_kamar_mandi`
JOIN `peraturan` ON `peraturan`.`id_peraturan` = `kost`.`id_peraturan`
JOIN `fasilitas_umum` ON `fasilitas_umum`.`id_fasum` = `kost`.`id_fasum`
JOIN `fasilitas_parkir` ON `fasilitas_parkir`.`id_fparkir` = `kost`.`id_fparkir`